Tekla Open API Reference for Tekla Structures 2025
View.ViewMarkSymbolAttributes.LineLengthType Property
 The label line length type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public View.LabelLineLengthType LineLengthType { get; set; }
Public Property LineLengthType As View.LabelLineLengthType
	Get
	Set
Property Value
Type: View.LabelLineLengthType
See Also
Reference
View.ViewMarkSymbolAttributes Class
Tekla.Structures.Drawing Namespace